InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаВозврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВозврат</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияЭтапаЭкспертизы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертифицированнаяТорговаяТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОтправкаТовараКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапЭкспертизы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыЭкспретизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОформленоНаПланшете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочтаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСклада_СтороннийСклад</Name>
							<Comment>СправочникСсылка.СторонниеСклады</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СторонниеСклады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиИзРТУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыМаркировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

WebServices/GetDocsReturn/Ext/Module.bsl
Функция GetDocsReturn(Incom)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис GetDocsReturn", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. Result");
	
	Результат = GetDocsReturn_(Incom);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис GetDocsReturn", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. Result " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции

Функция GetDocsReturn_(Параметры)
	
	//получаем входящие параметры
	ИДДок	  = Параметры.Doc_ID;
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.GetDocsReturn.ПространствоИмен, "RS_getDocsRet");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	
	//Создаем строку ответа
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.GetDocsReturn.ПространствоИмен, "Out_getDocsRet");  
	НетДокумента = Ложь;
	Формат = "PDF";
	ДокВозврат = Документы.ЗаявкаНаВозврат.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДДок));
	
	Если ЗначениеЗаполнено(ДокВозврат) тогда
		ДокОбъект = ДокВозврат.ПолучитьОбъект();
	Иначе
		
		СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
		СтрокаВозврата.Status = 1;
		РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
		Возврат	РезультатДляВозвратаПорталу;
		
	КонецЕсли; 
	
	ТаблДокВозврат = Новый ТабличныйДокумент;
	ТаблДокВозврат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТаблДокВозврат.АвтоМасштаб = Истина;
	
	//Формируем письмо-претензию
	ПечатнаяФормаВозврат  = ПечатьВозврата(ДокОбъект); 
	ТаблДокВозврат.Вывести(ПечатнаяФормаВозврат);
	ТаблДокВозврат.ВывестиГоризонтальныйРазделительСтраниц();
	
	//Формируем заявлениен на возврат для розничных или возврат
	Если ДокОбъект.Реализация.ДоговорКонтрагента.РозничнаяПродажа Тогда	
		ПечатнаяФормаПисьмо = ДокОбъект.ПечатьЗаявлениеНаВозвратФизЛица("ЗаявлениеНаВозвратФизЛицаПортал", Истина);  
	Иначе
		ПечатнаяФормаПисьмо =  ПечатьПретензии(ДокОбъект);
	КонецЕсли;
	
	ВремТабДок = Новый ТабличныйДокумент;
	ОбластьЯчеек = ВремТабДок.Вывести(ПечатнаяФормаПисьмо);		
	ОбластьЯчеек.СоздатьФорматСтрок();
	ТаблДокВозврат.Вывести(ВремТабДок);
	
	НазваниеДокумента = ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект.Ссылка, "Заявка на возврат");
	НазваниеДокумента = СтрЗаменить(НазваниеДокумента, "/", "-");
	НазваниеДокумента = СтрЗаменить(НазваниеДокумента, ".", ""); 
	
	Если ВРег(Формат) = "PDF" тогда
		
		ПолноеИмяФайла = КаталогВременныхФайлов() + НазваниеДокумента + ".pdf";
		ТаблДокВозврат.Записать(ПолноеИмяФайла,ТипФайлаТабличногоДокумента.PDF); 
		Рез = Base64Строка(Новый ДвоичныеДанные(ПолноеИмяФайла));
		УдалитьФайлы(ПолноеИмяФайла);
		
	ИначеЕсли ВРег(Формат) = "XLS" тогда
		
		ПолноеИмяФайла = КаталогВременныхФайлов() + НазваниеДокумента + ".xls";
		ТаблДокВозврат.Записать(ПолноеИмяФайла,ТипФайлаТабличногоДокумента.XLS); 
		Рез = Base64Строка(Новый ДвоичныеДанные(ПолноеИмяФайла));
		УдалитьФайлы(ПолноеИмяФайла);
		
	Иначе
		
		СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
		СтрокаВозврата.Status = 2;
		РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
		Возврат	РезультатДляВозвратаПорталу;	
		
	КонецЕсли;
	
	//Ответ
	СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
	СтрокаВозврата.Status     = 0;
	СтрокаВозврата.DocFile    = Рез;
	СтрокаВозврата.LetterFile = "";
	РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
	Возврат	РезультатДляВозвратаПорталу;	

КонецФункции

Функция ПечатьПретензии(ПромОбъект) Экспорт 
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаВозврат";
	Макет = ПромОбъект.ПолучитьМакет("ПретензияПортал");
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозврат.Реализация,
	|	ЗаявкаНаВозврат.Реализация.Контрагент.ИНН КАК ИНН,
	|	ВЫБОР
	|		КОГДА ЗаявкаНаВозврат.Реализация.Контрагент.КПП = """"
	|			ТОГДА "" -------""
	|		ИНАЧЕ ЗаявкаНаВозврат.Реализация.Контрагент.КПП
	|	КОНЕЦ КАК КПП,
	|	КонтактнаяИнформация.Представление КАК ЮрАдрес,
	|	ЗаявкаНаВозврат.Реализация.Организация.Наименование КАК ОрганизацияНаименование,
	|	ЗаявкаНаВозврат.Реализация.Организация.ИНН КАК ОрганизацияИНН,
	|	ЗаявкаНаВозврат.Реализация.Организация.КПП КАК ОрганизацияКПП,
	|	ЗаявкаНаВозврат.Номер КАК Номер,
	|	ЗаявкаНаВозврат.Дата КАК Дата,
	|	ЗаявкаНаВозврат.Комментарий КАК ТекстКомментарий,
	|	ЗаявкаНаВозврат.Реализация.Контрагент.НаименованиеПолное КАК Контрагент
	|ИЗ
	|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ЗаявкаНаВозврат.Реализация.Контрагент = КонтактнаяИнформация.Объект
	|ГДЕ
	|	ЗаявкаНаВозврат.Ссылка = &Ссылка
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид";
	
	ЗапросШапка.УстановитьПараметр("Ссылка", ПромОбъект.Ссылка);
	ЗапросШапка.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	ЗапросШапка.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);

	ВыборкаШапка = ЗапросШапка.Выполнить().Выбрать();
	
	Если ВыборкаШапка.Следующий() Тогда
		
		СчетФактура = УчетНДС.НайтиПодчиненныйДокумент(ПромОбъект.Реализация, "СчетФактураВыданный"); 
		
		Если ЗначениеЗаполнено(СчетФактура) Тогда
			
			НомерУПД = СчетФактура.Номер;
			ДатаУПД = СчетФактура.Дата;
			
		Иначе
			
			НомерУПД = ВыборкаШапка.Реализация.Номер;
			ДатаУПД = ВыборкаШапка.Реализация.Дата;
			
		КонецЕсли;
		
		Обл   = Макет.ПолучитьОбласть("Заголовок");
		Обл.Параметры.Заполнить(ВыборкаШапка);		
		Обл.Параметры.ТекстДоговор = "В рамках договора поставки с " + ВыборкаШапка.ОрганизацияНаименование + " ИНН/КПП " 
		+ ВыборкаШапка.ОрганизацияИНН + "/" + ВыборкаШапка.ОрганизацияКПП + " по УПД № " + НомерУПД 
		+ " от " + Формат(ДатаУПД, "ДФ=dd.MM.yyyy") + " нами были получены следующие позиции: "; 
		ТабДокумент.Вывести(Обл);
		Обл = Макет.ПолучитьОбласть("Шапка");	
		ТабДокумент.Вывести(Обл);
		
	КонецЕсли;
	
	ЗапросТЧ = Новый Запрос;
	ЗапросТЧ.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозвратТовары.Ссылка,
	|	ЗаявкаНаВозвратТовары.НомерСтроки,
	|	ЗаявкаНаВозвратТовары.Номенклатура,
	|	ЗаявкаНаВозвратТовары.Количество,
	|	ЗаявкаНаВозвратТовары.Цена,
	|	ЗаявкаНаВозвратТовары.Сумма,
	|	ЗаявкаНаВозвратТовары.Тип,
	|	ЗаявкаНаВозвратТовары.Статус,
	|	ЗаявкаНаВозвратТовары.ЕдиницаИзмерения,
	|	ЗаявкаНаВозвратТовары.Комментарий,
	|	ЗаявкаНаВозвратТовары.IDСклада_СтороннийСклад,
	|	ЗаявкаНаВозвратТовары.Номенклатура.КодПроизводителя КАК Артикул,
	|	ЗаявкаНаВозвратТовары.Номенклатура.Родитель КАК Производитель
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка";
	
	ЗапросТЧ.УстановитьПараметр("Ссылка", ПромОбъект.Ссылка);
	ИтогоСумма = 0;
	ВыборкаТЧ = ЗапросТЧ.Выполнить().Выбрать();
	
	Пока ВыборкаТЧ.Следующий() Цикл
		
		Обл = Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Заполнить(ВыборкаТЧ);
		ТабДокумент.Вывести(Обл);
		ИтогоСумма = ИтогоСумма + ВыборкаТЧ.Сумма;
		
	КонецЦикла;
	
	Обл = Макет.ПолучитьОбласть("Подвал");
	Обл.Параметры.Заполнить(ВыборкаШапка);
	Обл.Параметры.Сумма = ИтогоСумма;
	Обл.Параметры.ТекстКомментарий = "";
	ТабДокумент.Вывести(Обл);
	
	Для Сч = 1 По 60 - ТабДокумент.ВысотаТаблицы Цикл
		
		Обл = Макет.ПолучитьОбласть("ПустаяСтрока");
		ТабДокумент.Вывести(Обл);
		
	КонецЦикла;
	
	Обл = Макет.ПолучитьОбласть("Низ");
	Обл.Параметры.Заполнить(ВыборкаШапка);
	Обл.Параметры.Сумма = ИтогоСумма;
	Обл.Параметры.ВремяПечати = ТекущаяДата();
	ТабДокумент.Вывести(Обл); 
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Возврат ТабДокумент;

КонецФункции

Функция ПечатьВозврата(ПромОбъект) Экспорт 
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаВозврат";
	Макет = ПромОбъект.ПолучитьМакет("Возврат");
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозврат.Реализация,
	|	ЗаявкаНаВозврат.Реализация.Контрагент КАК Поставщик,
	|	ЗаявкаНаВозврат.Реализация.Контрагент.ИНН КАК ИНН,
	|	ЗаявкаНаВозврат.Реализация.Контрагент.КПП КАК КПП,
	|	КонтактнаяИнформация.Представление КАК ЮрАдрес,
	|	ЗаявкаНаВозврат.Реализация.Организация.Наименование КАК ОрганизацияНаименование,
	|	ЗаявкаНаВозврат.Реализация.Организация.ИНН КАК ОрганизацияИНН,
	|	ЗаявкаНаВозврат.Реализация.Организация.КПП КАК ОрганизацияКПП,
	|	ЗаявкаНаВозврат.Номер КАК Номер,
	|	ЗаявкаНаВозврат.Дата КАК Дата,
	|	ЗаявкаНаВозврат.Реализация.Номер,
	|	ЗаявкаНаВозврат.Реализация.Дата,
	|	ЗаявкаНаВозврат.Реализация.Грузополучатель КАК филиал,
	|	ЗаявкаНаВозврат.Комментарий КАК Примечание,
	|	ЕСТЬNULL(СчетФактураВыданный.Номер, """") КАК СФНомер,
	|	ЕСТЬNULL(СчетФактураВыданный.Дата, """") КАК СФДата
	|ИЗ
	|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ЗаявкаНаВозврат.Ссылка = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СчетФактураВыданный.ДокументОснование = ЗаявкаНаВозврат.Реализация
	|ГДЕ
	|	ЗаявкаНаВозврат.Ссылка = &Ссылка";
	
	ЗапросШапка.УстановитьПараметр("Ссылка", ПромОбъект.Ссылка);
	ВыборкаШапка = ЗапросШапка.Выполнить().Выбрать();
	
	РеализацияНомер = "";
	РеализацияДата = "";
	ТипВозврата = "";
	ВозвратТовара = "";
	
	ЗапросШапкаРекламация = Новый Запрос;
	ЗапросШапкаРекламация.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаявкаНаВозвратТовары.Тип,
	|	ЗаявкаНаВозвратТовары.Ссылка
	|ПОМЕСТИТЬ втТипПервойСтроки
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаВозвратТовары.Тип) КАК ТипВозвратаКоличествоРазличных,
	|	ЗаявкаНаВозвратТовары.Ссылка
	|ПОМЕСТИТЬ втКоличествоТипов
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаВозвратТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКоличествоТипов.ТипВозвратаКоличествоРазличных,
	|	втТипПервойСтроки.Тип
	|ИЗ
	|	втТипПервойСтроки КАК втТипПервойСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКоличествоТипов КАК втКоличествоТипов
	|		ПО втТипПервойСтроки.Ссылка = втКоличествоТипов.Ссылка";
	
	ЗапросШапкаРекламация.УстановитьПараметр("Ссылка", ПромОбъект.Ссылка);
	ВыборкаШапкаРекламация = ЗапросШапкаРекламация.Выполнить().Выбрать();
	
	Если ВыборкаШапкаРекламация.Следующий() и ВыборкаШапкаРекламация.ТипВозвратаКоличествоРазличных = 1 И ВыборкаШапкаРекламация.Тип = "Рекламация" Тогда
		
		ТипВозврата = "Возврат брака";
		ВозвратТовара = "Рекламация покупателя";
		
	Иначе
		
		ТипВозврата = "Возврат";
		ВозвратТовара = "Возврат товара";
		
	КонецЕсли;
	
	Если ПромОбъект.Реализация.ДоговорКонтрагента.РозничнаяПродажа Тогда
		ВозвратТовара = ВозвратТовара + " " + "(розн)";	
	КонецЕсли;	
	
	Если ВыборкаШапка.Следующий() Тогда
		
		Обл   = Макет.ПолучитьОбласть("Заголовок");
		Обл.Параметры.Заполнить(ВыборкаШапка);
		Обл.Параметры.ВремяПечати = ТекущаяДата();
		Обл.Параметры.Возврат = ТипВозврата;
		Обл.Параметры.ВозвратТовара = ВозвратТовара;
		
		Если ВыборкаШапка.СФНомер = "" Тогда 
			
			РеализацияНомер = ВыборкаШапка.РеализацияНомер;
			РеализацияДата = ВыборкаШапка.РеализацияДата;
			
		Иначе
			
			РеализацияНомер = ВыборкаШапка.СФНомер;
			РеализацияДата = ВыборкаШапка.СФДата;
			
		КонецЕсли;
		
		ИмяРисункаШК = "D1";
		КоличествоМиллиметровВПикселе = 0.26;
		
		ПараметрыШтрихкода = Новый Структура;
		ПараметрыШтрихкода.Вставить("Ширина",          Окр(Обл.Рисунки[ИмяРисункаШК].Ширина / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Высота",          Окр(Обл.Рисунки[ИмяРисункаШК].Высота / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(ПромОбъект.Ссылка)));
		ПараметрыШтрихкода.Вставить("ТипКода",         4); // Code128
		ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
		ПараметрыШтрихкода.Вставить("РазмерШрифта",    9);
		Обл.Рисунки[ИмяРисункаШК].Картинка = ОбщегоНазначения.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		ТабДокумент.Вывести(Обл);
		
		Обл = Макет.ПолучитьОбласть("Шапка");	
		ТабДокумент.Вывести(Обл);
		
	КонецЕсли;
	
	ЗапросТЧ = Новый Запрос;
	ЗапросТЧ.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозвратТовары.Ссылка,
	|	ЗаявкаНаВозвратТовары.НомерСтроки,
	|	ЗаявкаНаВозвратТовары.Номенклатура,
	|	ЗаявкаНаВозвратТовары.Количество,
	|	ЗаявкаНаВозвратТовары.Цена,
	|	ЗаявкаНаВозвратТовары.Сумма,
	|	ЗаявкаНаВозвратТовары.Тип,
	|	ЗаявкаНаВозвратТовары.Статус,
	|	ЗаявкаНаВозвратТовары.ЕдиницаИзмерения,
	|	ЗаявкаНаВозвратТовары.Комментарий,
	|	ЗаявкаНаВозвратТовары.IDСклада_СтороннийСклад,
	|	ЗаявкаНаВозвратТовары.Номенклатура.Артикул КАК Артикул,
	|	ЗаявкаНаВозвратТовары.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	ЗаявкаНаВозвратТовары.Номенклатура.Родитель КАК Производитель,
	|	1 КАК Коэффициент,
	|	ЗаявкаНаВозвратТовары.Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка";
	
	ЗапросТЧ.УстановитьПараметр("Ссылка", ПромОбъект.Ссылка);
	
	ИтогоКоличество = 0;
	ИтогоСумма = 0;
	
	ВыборкаТЧ = ЗапросТЧ.Выполнить().Выбрать();
	
	Пока ВыборкаТЧ.Следующий() Цикл
		
		Обл = Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Заполнить(ВыборкаТЧ);
		Обл.Параметры.Реализация = РеализацияНомер + " от " + Формат(РеализацияДата, "ДФ=dd.MM.yyyy"); 
		Обл.Параметры.ПредставлениеТовара = ВыборкаТЧ.КодПроизводителя + " " + ВыборкаТЧ.Наименование;
		ИтогоКоличество = ИтогоКоличество + ВыборкаТЧ.Количество;
		ИтогоСумма = ИтогоСумма + ВыборкаТЧ.Сумма;
		ТабДокумент.Вывести(Обл);
		
	КонецЦикла;
	
	Обл = Макет.ПолучитьОбласть("Подвал");
	Обл.Параметры.Количество = ИтогоКоличество;
	Обл.Параметры.Сумма = ИтогоСумма;
	ТабДокумент.Вывести(Обл);
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Возврат ТабДокумент;

КонецФункции

Функция  ПечатьЗаявлениеНаВозвратФизЛица(ПромОбъект) Экспорт 
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаВозвратПортал";
	Макет = ПромОбъект.ПолучитьМакет("ЗаявлениеНаВозвратФизЛицаПортал");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	СведенияОбОрганизации  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ПромОбъект.Реализация.Организация,ПромОбъект.Дата,, ПромОбъект.Реализация.Организация.ОсновнойБанковскийСчет); 
	ОбластьШапка.Параметры.НаименованиеОрганизации = СведенияОбОрганизации.Представление;
	ОбластьШапка.Параметры.АдресОрганизации = СведенияОбОрганизации.ЮридическийАдрес;
	ОбластьШапка.Параметры.ИННКПП = СведенияОбОрганизации.ИНН + "/" + СведенияОбОрганизации.КПП;
	ОбластьШапка.Параметры.РасчетныйСчет = "Р/с " + СведенияОбОрганизации.НомерСчета;
	ОбластьШапка.Параметры.НаименованиеБанка = СведенияОбОрганизации.Банк;
	ОбластьШапка.Параметры.БикБанка = "БИК " + СведенияОбОрганизации.БИК;
	ОбластьШапка.Параметры.КоррСчет = "К/с " + СведенияОбОрганизации.КоррСчет;
	
	Если НЕ СведенияОбОрганизации.Банк = "" Тогда 
		ОбластьШапка.Параметры.ТелефонБанка = ?(ЗначениеЗаполнено(СведенияОбОрганизации.Банк.Телефоны), "Тел." + СведенияОбОрганизации.Банк.Телефоны, "");
	КонецЕсли;
	
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(ПромОбъект.Реализация.Организация, ПромОбъект.Дата,);
	ОбластьШапка.Параметры.ФИОДиректора = Руководители.Руководитель; 
	ТабДокумент.Вывести(ОбластьШапка);
	
	ОбластьСтроки = Макет.ПолучитьОбласть("Строки");
	ОбластьСтроки.Параметры.ДатаРеализации = Формат(ПромОбъект.Реализация.Дата,"ДЛФ=DD");
	ПромСтрокаТовары = "";
	
	Для Каждого СтрокаТовары Из ПромОбъект.Товары Цикл
		ПромСтрокаТовары = ПромСтрокаТовары  +  ?(СокрЛП(ПромСтрокаТовары)="","",Символы.ПС) + СокрЛП(СтрокаТовары.Номенклатура.Наименование) + " " + СокрЛП(СтрокаТовары.Номенклатура.КодПроизводителя) + " " + СокрЛП(СтрокаТовары.Номенклатура.Родитель) + " - " + СтрокаТовары.Количество + " шт.";
	КонецЦикла;
	
	СуммаПоДокументу = ПромОбъект.Товары.Итог("Сумма");
	ОбластьСтроки.Параметры.СуммаВозврата = Формат(СуммаПоДокументу, "ЧДЦ=2; ЧРД=,; ЧГ=") + " руб. (" + ОбщегоНазначения.СформироватьСуммуПрописью(СуммаПоДокументу, ПромОбъект.Реализация.ВалютаДокумента) + ")";
	ОбластьСтроки.Параметры.СписокТоваров = ПромСтрокаТовары;
	ОбластьСтроки.Параметры.Год = Формат(ТекущаяДата(), "ДФ=yyyy");
	ТабДокумент.Вывести(ОбластьСтроки);
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Возврат ТабДокумент;

КонецФункции
